{
    "snippets": [
        {
            "id": "1001",
            "total_listens": "0",
            "topics": ["oil","finance","world"],
            "source": "Wall Street Journal",
            "transcript": "Hopes for a truce in the global oil-price war powered crude to its biggest one-day percentage gain on record Thursday, with investors betting a globally coordinated production cut would alleviate some of the pressure from the coronavirus crisis. The gains capped a wild day of trading, in which an early climb accelerated after President Trump tweeted that he expected Russia and Saudi Arabia to agree to cut production by millions of barrels. Prices for Brent, the global benchmark, then soared as much as 47% before slowing after the Kremlin denied talking to the Saudis. The climb then stabilized after Saudi officials said the kingdom would consider substantial output cuts as long as others in the G-20 group of nations were willing to join the effort. While investors still expect the coronavirus crisis to deliver a major blow to global oil demand, Thursday’s news offered a glimmer of hope that major producers can avoid a protracted conflict, lifting shares of beleaguered energy companies. Energy shares have been the best-performing group in the S&P 500 so far this week, with shares of Exxon Mobil Corp. gaining 7.3% and shares of Chevron Corp. gaining 7.8%. “This is a positive surprise for the market, but we’re still a long way off from seeing actual material cuts,” said Gary Ross, chief executive of Black Gold Investors LLC. “Demand is still being devastated.” U.S. crude oil closed up 25% at $25.32 a barrel, logging its sharpest percentage gain on record, according to a Dow Jones Market Data analysis of figures going back to 1983. Brent rose 21% to $29.94, also recording its best day on record, according to data going back to 1988. The gains marked a rare bright spot for oil prices in recent weeks. Both Brent and U.S. crude are still down more than 50% so far this year, leaving many traders skeptical that production cuts alone can lift prices back near recent highs. Capping traders’ enthusiasm: oil storage is rapidly filling up while demand for fuel has plummeted, with swaths of the globe shutting down all but essential services in an effort to combat the spread of the coronavirus. Factories have closed and restaurants have shuttered. Airlines are scaling back on flights and people aren’t driving. Many expect a deep recession world-wide. Investment banks and commodities trading houses have slashed their forecasts for daily global oil demand by tens of millions of barrels. A truce between the Russians and Saudis would do little to shift those dynamics, many analysts said, and might even cause greater problems. “It’s physically impossible for Saudi Arabia and Russia to get 10 million barrels a day off the market—they’d burst their onshore storage and fill every ship in sight,” said Edward Marshall, a commodities trader at Global Risk Management. “Even with OPEC on board, that’s a phenomenal amount of oil, and it’ll be very difficult to get everyone on side.” The slide has hit energy companies hard, pushing many to the brink and dashing others’ plans to restructure their operations. Shares of Exxon and ConocoPhillips have both shed more than 40% of their value so far in 2020. Earlier this week, U.S. shale driller Whiting Petroleum Corp. filed for bankruptcy protection, becoming the first sizable fracking company to succumb to the crash in oil prices. The president is set to meet Friday with the heads of some of the largest U.S. oil companies to discuss measures to help the industry as it fights for survival. The chief executives of Exxon, Chevron Corp. and Continental Resources Inc. are expected to attend.\r\nInvestors were hopeful that President Trump’s tweets signaled a thaw in the price war, which began in early March, after the Saudi-led Organization of the Petroleum Exporting Countries and a group of other oil-producing countries dominated by Russia failed to deepen production cuts by 1.5 million barrels. But some analysts doubt that coordinated cuts of the size he described Thursday are even possible. “It’s highly unlikely these parties would agree to these cuts,” said Spencer Welch, director of oil markets at IHS Markit. “It’s not just [requiring] the Russians coming back and offering significantly more cuts than at the last OPEC+ meeting, but you’ve also got hundreds more producers across the U.S. needing to pass the legislation to enforce those cuts.” The two periods of the sharpest oil inventory builds in recent years were in early 2005 and early 2015, when stocks rose by around 400 million barrels, according to IHS Markit data. But currently IHS expects global oil inventories to rise by three times that amount in the first half of this year.",
            "time_length": "0",
            "num_words": "0",
            "source_link": "https://www.wsj.com/articles/oil-leaps-on-hopes-for-u-s-action-end-to-saudi-russia-spat-11585821756?mod=hp_lead_pos4",
            "title": "Crude Leaps More Than 20% on Hopes for End to Price War"
        },
        {
            "id": "1002",
            "total_listens": "3",
            "topics": ["finance","hedge fund","economy","coronavirus"],
            "source": "Wall Street Journal",
            "transcript": "Chris Hansen saw it coming. Mr. Hansen, who runs San Francisco hedge fund Valiant Capital Management, had an early conviction the novel coronavirus would wreak havoc on the global economy. Mr. Hansen and his team homed in early on the risks the virus posed and placed wagers accordingly, said people familiar with the firm. In late January, Valiant boosted its bet against stock indexes as it became more concerned about the virus. In February, Valiant started placing bets against, or shorting, levered companies it viewed as likely to be hurt from an economic slowdown caused by the virus. As the market plummeted, Valiant posted gains on those bets, including some on cruise lines, international airlines and travel companies. By early March, the fund had begun shorting less obvious candidates, believing those with weak balance sheets and companies it viewed as fraudulent would be caught out in a prolonged slump. By the end of March, Valiant was up 36% for the year before fees, said the people familiar with the firm. The return stands in contrast to a 19.6% drop in the S&P 500 and a 21.3% decline in the MSCI All World Index, a broad global index measuring the performance of stocks around the world. “Protecting capital from downturns has always been a core part of our strategy, and once again it is nice to see it pay off when it matters the most,” Mr. Hansen wrote in a March 12 investor letter. That letter told investors the fund was up 25% before fees and didn’t elaborate on how Valiant had scored those gains. In addition to its stock bets, Valiant also notched gains on credit protection on global investment-grade and high-yield bond indexes it had bought in mid-February that became more valuable as the likelihood of corporate defaults rose, one of the people said. The fund had closed half of that hedge a month later. The returns for Valiant mark some of the best returns in the hedge-fund industry through the market tumult to date. A low-profile investor who is known on Wall Street for short selling and investing in private companies, Mr. Hansen is better known in some quarters for his years long effort to bring a professional basketball team to his hometown of Seattle. He was a blunt messenger when it came to the coronavirus. At a Jackson Hole, Wyo., investment conference on March 5, he told an audience of wealthy families and private investors to go to cash, stock up on medication and prepare for the pandemic to fundamentally alter life. “He was speaking to an audience of 80 or 90 people and said that 10 to 20 of us will likely contract the virus and several of us will, statistically speaking, die,” said Matthew Lusins, a partner at real estate private-equity firm Convergence Investments, which organized the charitable conference. Mr. Lusins said Mr. Hansen asked for a list of international attendees before agreeing to speak at the conference and didn’t mingle afterward. Shorting companies and hedging portfolios became unfashionable over the last decade as low interest rates propelled stock markets to historic highs. While hedge funds betting on and against stocks aren’t expected to keep up with a roaring bull market, sustained periods of underperformance can lead to investor frustration and defections. Valiant, founded by Mr. Hansen in mid-2008 after he left hedge-fund firm Blue Ridge Capital, wasn’t immune to the pressure to keep pace. The fund had notched gains of 8.2% and 13.1% in 2008 and 2011, respectively, and made money 73% of the months the S&P was down, according to investor documents. But, its investor base had shrunk as its focus on shorting companies it believed were fraudulent, or deceived regulators and shareholders, hurt returns. Valiant also holds the stock of roughly two dozen companies at any given time and holds its biggest positions for an average of more than five years. In separate structures, it invests in private companies, mainly in the U.S. and India. But the fund continued to short individual stocks and pay for hedges—moves that turned out to be profitable in the market tumult this year. When stock markets started their roller-coaster ride in late February, the $1.4 billion stock hedge fund also began profiting on bets it had made against companies it viewed as fraudulent or fragile months or, in some cases, years ago. The firm also has cashed in put options, contracts that give the owner the right to sell shares by a certain date at a specific price, it had bought on the cheap against stock indexes in the U.S. and India, according to people familiar with the firm. Valiant bought additional puts on stock indexes starting in late January as it became more concerned about the virus, said a person familiar with the firm. That move pushed the size of its index hedges to a historic high. At their peak, the notional value of the options contracts were between $1 billion and $2 billion—a hedge equivalent to the size of Valiant’s portfolio. China’s mass quarantining of Wuhan starting on Jan. 23 and later that month of the Hubei province, where the coronavirus first emerged, was a key signal that the virus was a serious threat, one person familiar with the fund said. The fund also was influenced by Harvard epidemiologist Marc Lipsitch and other health-care experts, who were sounding the alarm as early as January. The stock market’s blithe climb upward even as China shut down and the virus spread to South Korea and Italy recalled other moments of extreme dissonance to the team at Valiant, such as the housing market crisis or the internet bubble, the people familiar with the firm said. Mr. Hansen in recent weeks has told investors Valiant has little edge on the virus now that it has reshaped daily life and the economy so dramatically.",
            "time_length": "0",
            "num_words": "0",
            "source_link": "https://www.wsj.com/articles/this-hedge-fund-saw-risks-of-coronavirus-early-now-its-up-36-11585819802?mod=lead_feature_below_a_pos1",
            "title": "This Hedge Fund Saw Risks of Coronavirus Early. Now It’s Up 36%."
        },
        {
            "id": "1003",
            "total_listens": "5",
            "topics": "movies",
            "source": "CNN",
            "transcript": "For those eagerly awaiting the \"Top Gun\" sequel, the wait just got a little longer. A spokesperson for Paramount confirmed to CNN Thursday that the North American release date for \"Top Gun: Maverick\" has been moved from June 24 to December 23. The follow-up to the hit 1986 film has Tom Cruise reprising his role as US Naval aviator Pete \"Maverick\" Mitchell. \"Top Gun: Maverick\" joins a multitude of films whose releases have been postponed in light of the coronavirus pandemic which has shut down movie theaters across the country.",
            "time_length": "0",
            "num_words": "0",
            "source_link": "https://www.cnn.com/2020/04/02/entertainment/top-gun-maverick-delayed/index.html",
            "title": "Top Gun: Maverick' release date pushed back"
        },
        {
            "id": "1004",
            "total_listens": "12",
            "topics": ["coronavirus","health"],
            "source": "CNN",
            "transcript": "What are the telling signs that you may have the novel coronavirus which causes Covid-19? The main list of acute symptoms at this time is actually quite short and can appear anywhere from two to 14 days after exposure to the virus, according to the US Centers for Disease Control and Prevention. \"We're emphasizing fever plus a notable lower respiratory tract symptom -- cough or trouble breathing,\" said infectious disease expert Dr. William Schaffner, a professor of preventative medicine and infectious disease at Vanderbilt University School of Medicine in Nashville. Being able to identify those symptoms and act upon them when necessary is critical.\r\nHere's what you need to know. Fever. Fever is a key symptom, experts say. Don't fixate on a number, but know it's really not a fever until your temperature reaches at least 100 degrees Fahrenheit (37.7 degrees Celsius) for children and adults. \"There are many misconceptions about fever. Average daily temperature is 98.6 degrees Fahrenheit (37 degrees Celsius), but we all actually go up and down quite a bit during the day as much as half of a degree or a degree,\" said Dr. John Williams, chief of the division of pediatric infectious diseases at the University of Pittsburgh Medical Center Children's Hospital of Pittsburgh. \"So 99.0 degrees or 99.5 degrees Fahrenheit is not a fever,\" he stressed. When you check for fever, don't rely on a temperature taken in the morning. Instead take your temp in the late afternoon and early evening. \"Our temperature is not the same during the day. If you take it at eight o'clock in the morning, it may be normal,\" Schaffner explained. \"One of the most common presentations of fever is that your temperature goes up in the late afternoon and early evening -- it's a common way that viruses produce fever.\" Cough. Coughing is another key symptom, but it's not just any cough, said Schaffner. It should be a dry cough that you feel in your chest.  \"It's not a tickle in your throat. You're not just clearing your throat. It's not just irritated. You're not putting anything out, you're not coughing anything up,\" Schaffner said. \"The cough is bothersome, it's coming from your breastbone or sternum. and you can tell that your bronchial tubes are inflamed or irritated,\" he added. Difficulty breathing. Shortness of breath can be a third -- and very serious -- manifestation of Covid-19, and it can occur on its own, without a cough. If your chest becomes tight or you begin to feel as if you cannot breathe deeply enough to get a good breath, that's a sign to act, experts say. \"If there's any shortness of breath immediately call your health care provider, a local urgent care or the emergency department,\" said American Medical Association president Dr. Patrice Harris. \"If the shortness of breath is severe enough, you should call 911,\" Harris added. In addition to difficulty breathing or shortness of breath, the CDC lists emergency warning signs for Covid-19 as a \"persistent pain or pressure in the chest,\" \"bluish lips or face\" -- which indicates a lack of oxygen -- and any sudden mental confusion or lethargy and inability to rouse. Get medical attention immediately, the CDC says. Flu and cold symptoms. This trifecta of symptoms -- fever, cough and shortness of breath -- are not the only signs of sickness that have been seen in cases of Covid-19. Many other symptoms can resemble the flu, including headaches, digestive issues, body aches and fatigue, which can be severe. Still other symptoms can resemble a cold or allergies, such as a runny nose, sore throat and sneezing. Most likely, experts say, you simply have a cold or the flu -- after all they can cause fever and cough too. One possible sign that you might have Covid-19 is if your symptoms, especially shortness of breath, don't improve after a week or so but actually worsen. Unusual symptoms. An odd symptom that might flag a Covid-19 infection in its early stages was recently identified by the American Academy of Otolaryngology-Head and Neck Surgery. In a statement on their website, they said symptoms of anosmia, or lack of sense of smell, and dysgeusia, or lack of taste, should be used to identify possible Covid-19 infections. Doctors say loss of sense of smell might be Covid-19 symptom Doctors say loss of sense of smell might be Covid-19 symptom. \"Anosmia, in particular, has been seen in patients ultimately testing positive for the coronavirus with no other symptoms,\" the statement says. It has long been known in medical literature that a sudden loss of smell may be associated with respiratory infections caused by other types of coronaviruses. The same applies to conjunctivitis, a highly contagious condition also known as pink eye. Conjunctivitis is an inflammation of the thin, transparent layer of tissue, called conjunctiva, that covers the white part of the eye and the inside of the eyelid. Reports from China and around the world are showing that about 1% to 3% of people with Covid-19 also had conjunctivitis. But this novel coronavirus, also called SARS-CoV-2, is just one of many viruses that can cause conjunctivitis, so it came as no real surprise to scientists that this newly discovered virus would do the same. Still, a pink or red eye could be one more sign that you should call your doctor if you also have other tell-tale symptoms of Covid-19, such as fever, cough or shortness of breath.\r\nOverall, \"I think we're getting a little bit more insight into the types of symptoms that patients might have,\" said CNN Chief Medical Correspondent Dr. Sanjay Gupta on the CNN's New Day news program. \"In a study out of China where they looked at some of the earliest patients, some 200 patients, they found that digestive or stomach GI (gastrointestinal) symptoms were actually there in about half the patients,\" Gupta said. The study described a unique sub-set of milder cases in which the initial symptoms were digestive issues such as diarrhea, often without fever. Those patients experienced delays in testing and diagnosis than patients with respiratory issues, and took longer to clear the virus from their systems. So what should you do? \"At this moment, the current guidance -- and this may change -- is that if you have symptoms that are similar to the cold and the flu and these are mild symptoms to moderate symptoms, stay at home and try to manage them,\" Harris said, with rest, hydration and the use of fever-reducing medications. That advice does not apply if you are over age 60, since immune systems weaken as we age, or if you are pregnant -- anyone with concerns about coronavirus should call their healthcare provider, according to the CDC. It's unclear whether pregnant women have a greater chance of getting severely ill from coronavirus, but the CDC has said that women experience changes in their bodies during pregnancy that may increase their risk of some infections. In general, Covid-19 infections are riskier if you have underlying health conditions such as diabetes, chronic lung disease or asthma, heart failure or heart disease, sickle cell anemia, cancer (or are undergoing chemotherapy), kidney disease with dialysis, a body mass index (BMI) over 40 (extremely obese) or an autoimmune disorder. \"Older patients and individuals who have underlying medical conditions or are immunocompromised should contact their physician early in the course of even mild illness,\" the CDC advises. To be clear, you are at higher risk -- even if you are young -- if you have underlying health issues. \"People under 60 with underlying illnesses, with diabetes, heart disease, immunocompromised or have any kind of lung disease previously, those people are more vulnerable despite their younger age,\" Schaffner said. A history of travel to an area where the novel coronavirus is widespread (and those parts of the world, including the US, are going up each day) is obviously another key factor in deciding if your symptoms may be Covid-19 or not. How to be evaluated. If you have no symptoms, please do not ask for testing or add to backlog of calls at testing centers, clinics, hospitals and the like, experts say. \"We do not test people with no symptoms because it's a resource issue,\" Schaffner said about the assessment center at Vanderbilt. \"However, we are emphasizing that people who have this small cluster of important symptoms -- fever and anything related to the lower respiratory tract such as cough and difficulty breathing -- reach out to be evaluated.\" If you do have those three signs, where should you go? \"If you have insurance and you're looking for a provider or someone to call or connect with, there's always a number on the back of your insurance card; or if you go online, there is information for patients,\" Harris said. \"If you don't have insurance, you can start with the state health department or the local community health centers, those are officially known as federally qualified health centers,\" Harris advised, adding that some states have a 1-800 hotline number to call. \"If there is a testing and assessment center near you, you can go there directly,\" Schaffer said. \"It's always good to notify them that you're coming. Otherwise, you need to call your healthcare provider and they will direct you what to do.\"",
            "time_length": "0",
            "num_words": "0",
            "source_link": "https://www.cnn.com/2020/03/31/health/coronavirus-symptoms-list-what-to-do-wellness/index.html",
            "title": "Coronavirus symptoms: A list and when to seek help"
        },
        {
            "id": "1005",
            "total_listens": "2",
            "topics": ["nba","basketball"],
            "source": "ESPN",
            "transcript": "Between 1995 and 2005, these nine future NBA All-Stars (including two future Hall of Famers) decided to skip college and head directly to the league. Kevin Garnett. Kevin Garnett became the first high school-to-NBA player drafted since Bill Willoughby in 1975 when the Minnesota Timberwolves took him fifth overall in '95. He went on to be named to 15 All-Star teams and won a ring with the Boston Celtics in 2008. Carl Sissac/The LIFE Images Collection via Getty Images. Kobe Bryant. Kobe Bryant never even took a college visit, sure he would go to the 1996 NBA draft out of Lower Merion High School in Pennsylvania. He was selected 13th overall by the Charlotte Hornets, who traded him to the Los Angeles Lakers two weeks later. Eileen Blass/USA TODAY Sports. Jermaine O'Neal. A year after fellow South Carolina native and McDonald's All American Kevin Garnett made the jump straight to the NBA, Jermaine O'Neal followed his path. O'Neal was drafted 17th overall by the Portland Trail Blazers in 1996. Doug Pensinger/Getty Images. Tracy McGrady. One of two Hall of Famers on this list (Kobe Bryant is the other), Tracy McGrady was taken ninth overall by the Toronto Raptors in 1997. He played in 988 games and earned seven All-Star nods in his 17-year career. AP Photo/Bob Jordan.\r\nTyson Chandler. Tyson Chandler was taken at No. 2 overall by the LA Clippers in 2001 but was traded to the Chicago Bulls, who picked up another high schooler, Eddy Curry, with the No. 4 overall pick. Tom Hauck/Getty Images. Amar'e Stoudemire. Stoudemire was named Mr. Basketball in Florida and a McDonald's All American his senior year at Cypress Creek in Orlando. He verbally committed to play at Memphis but instead entered the 2002 draft, where he was taken ninth by the Phoenix Suns. Jesse D. Garrabrant/NBAE via Getty Images. LeBron James. ESPN aired its first high school game in 2002, when LeBron James' St. Vincent-St. Mary High School in Akron, Ohio, took on top-ranked Oak Hill Academy from Virginia. James' double-double was a sign of what would come in the NBA. Phil Masturzo/Akron Beacon Journal via Getty Images. Dwight Howard. Dwight Howard's father said at his son's NBA draft declaration ceremony he hoped to see the Southwest Atlanta Christian Academy forward drafted by the hometown team. The Hawks never got the chance; the Orlando Magic took him first overall in 2004. Michael A. Schwarz/USA TODAY Sports. Andrew Bynum. His senior year at St. Joseph High School in Metuchen, New Jersey, Andrew Bynum stood 7-foot and weighed 300 pounds. The McDonald's All American decided to skip a scholarship to UConn and instead was picked 10th overall by the Lakers in 2005.",
            "time_length": "0",
            "num_words": "0",
            "source_link": "https://www.espn.com/nba/story/_/id/28971664/players-made-most-successful-jumps-high-school-nba",
            "title": "Players who made the most successful jumps from high school to the NBA"
        },
        {
            "id": "1006",
            "total_listens": "1",
            "topics": ["nfl","family"],
            "source": "ESPN",
            "transcript": "Brothers Trevon and Stefon Diggs would compete in everything growing up. One of Trevon's favorite games was knee football. They'd go in the basement, get on their knees and try to blast each other. But Stefon was more than a playmate to Trevon. Stefon, a top-tier wide receiver for the Buffalo Bills, became a father figure to Trevon, an NFL cornerback prospect, when Trevon was 10 years old. Their father, Aron Diggs, died in January 2008 at age 39 because of congestive heart failure. Aron gave Stefon, then 14, a mission: Take care of his mother, Stephanie; his sister, Porche Green; and his brothers Trevon and Mar'Sean (aka Darez). Stefon is the oldest of the Diggs siblings. \"[Stefon] is like my dad, honestly,\" Trevon said. \"He was there for me when my father passed, so he has always taken care of me. I always ask him everything, no matter what. Two o'clock in the morning, I'm asking him questions. I called him last night, every day, about this process and how he managed it.\" \"He just took us under his wing, knowing we didn't have a father figure,\" Mar'Sean told TwinCities.com in 2019. \"Just took on that role, basically. Guiding us, providing for us, being there when we needed him. Everything. Being a brother and a father. That's tough. That's a lot to ask of somebody that young.\" Thanks in part to Stefon's guidance, Trevon, who won a national championship in college at Alabama, is about to become the next Diggs to join the NFL ranks. Both Stefon and Trevon will find themselves in new environments this year. Stefon will be suiting up for a new team -- the Bills -- after being traded this offseason. Trevon, who spent four seasons playing for Crimson Tide coach Nick Saban, could be a first-round pick later this month. He was projected to be taken by the Minnesota Vikings at No. 25 in ESPN analyst Todd McShay's latest mock draft. That's the same team that drafted Stefon in the fifth round of the 2015 draft. Trevon watched Stefon's first NFL game, when he caught six passes for 87 yards. \"It's different when I watch him because I know what he can do,\" Trevon said. \"Other people watch him and act like they're surprised. I saw him do everything. I saw him play running back, corner, receiver. I know his talent level and that nobody in the NFL can guard him.\" Mar'Sean played football, too. He was a safety at UAB who had a tryout with the Vikings in 2019. It was their dad who got the boys started in the \"family business.\" Aron was their first coach and took them to practice every day before he died. Stefon and Trevon were always close as kids, but losing their father brought them even closer. Stefon used to walk Trevon to and from school and was there to defend his little brother when necessary. Added Trevon, \"People didn't want to mess with me because I would tell them I'd call my brother.\" Stefon was a standout player as a freshman at Our Lady of Good Counsel High School in Olney, Maryland. He was ranked as the No. 13 prospect in the nation in the Class of 2012 by ESPN. \"Stefon could've gone to any college in the country but chose to stay close to home,\" Stephanie said. \"I sat Stefon down in high school and told him he had to make good decisions and set a good example because your brother looks up to you.\" Although he received offers from bigger programs, Stefon went to Maryland so he could be close to his family. While Stefon was playing at Maryland, Trevon carved out his own standout high school career as a wide receiver and defensive back at the Avalon School in Wheaton, Maryland. Trevon felt like everyone was gunning for him because he was Stefon's little brother and the perception was that he didn't earn his reputation. Trevon said he didn't care about what others thought because he was \"going to get his regardless.\" There was pressure on Trevon -- who had offers from many of college football's biggest programs, including Clemson and Alabama -- to go to Maryland like his brother. As with everything else, Trevon sought counsel from his oldest brother. Stefon's advice was simple: \"Do what's best for your life.\" Trevon had Stefon by his side when he announced on national signing day Alabama would be his choice. Trevon didn't want to go to Maryland because he knew everything he did would be compared to Stefon. \"He did the Maryland thing and tore it up,\" Trevon said. \"Why would I go somewhere where a bar is already set? ... I'd always be in comparison to everything that he did. I was even playing receiver at the time. I wasn't trying to be under his shadow.\" Going to Alabama was a way to establish a name for himself. \"It was the best school for me,\" Trevon said. \"There were so many players down there. I wanted to be at the best program and win championships.\" Trevon played receiver his first season at Alabama, with 11 catches for 88 yards and a touchdown. But he made the switch to cornerback as a sophomore at Saban's suggestion. The key for Trevon was trusting Saban's plan. Trevon went to Stefon for advice all the time while in college. \"His brother plays a big role. If there's anybody he's going to consult with, it's his brother,\" Alabama teammate Terrell Lewis said. \"You can tell he gets all of his insight and advice from his big brother. That's a blessing to have someone in your corner like that.\" Trevon called Stefon and told him about the switch. \"He looks at everything like, 'All right. Let's get to work.' Adversity or anything like that, he tells me to just push through it and go get it,\" Trevon said. Having to compete in practice against likely 2020 first-round picks Henry Ruggs III and Jerry Jeudy helped prepare Trevon for what's to come. He used his background as a receiver to help him match patterns in coverage. Being familiar with routes and offensive concepts helped him become a better defender. Getting to compete with Stefon when they worked out in the summer was a bonus. The two brothers talked about everything before games. Trevon finished his final year at Alabama with three interceptions and eight passes defended. The two brothers serve as each other's biggest critics. Trevon said he always found a way to watch Stefon's games. He referred to a stretch when Stefon had a few fumbles and how he spoke to him about ball security. Stefon got on Trevon about tackling at one point as well. Knowing what each other endured to develop their games made it easier and more valuable. \"Every time I am with Trevon, he is constantly calling Stefon to ask questions about anything and everything,\" Trevon's manager, Maxx Lepselter, said. \"It's always great to see brothers look out for each other, let alone brothers who are in the same business and have gone through what these brothers have gone through.\" Trevon believed he could make it to the NFL when he saw Stefon do it. It was his motivation. He has always been a step behind Stefon. When Stefon left high school, Trevon was entering it. The same went for college and now the NFL. According to Trevon, Stefon \"hopes to get to line up against\" his brother at the next level. Trevon looks forward to the matchup as well, but in his mind the outcome is predetermined. \"The little brother always wins!\"",
            "time_length": "0",
            "num_words": "0",
            "source_link": "https://www.espn.com/nfl/story/_/id/28984964/trevon-diggs-embarks-nfl-path-paved-brother-father-figure-stefon",
            "title": "Trevon Diggs embarks on NFL path paved by brother, father figure Stefon"
        },
        {
            "id": "1007",
            "total_listens": "5",
            "topics": ["coronavirus","world"],
            "source": "Wall Street Journal",
            "transcript": "Confirmed cases of the novel coronavirus world-wide surpassed one million Thursday, a grim milestone for the pandemic as governments deploy increasingly stringent measures to battle its spread and a record 6.6 million U.S. workers applied for unemployment benefits last week. The U.S. has 234,462 reported cases of the coronavirus, which has spread with ferocious speed across the world, driven initially by global travel. That figure is just under a quarter of the global total, and nearly twice that of the next-highest country, Italy, according to data compiled by Johns Hopkins University, although the toll of death and illness might be underreported there and in other countries. As more states moved to initiate lockdowns, Ohio Gov. Mike DeWine announced extensions to existing policies as projections showed the virus’s impact extended well into the spring. “This extension is necessary,” Mr. DeWine said Thursday as he announced an order that will require residents to stay at home until May 1. Earlier Thursday, Michigan Gov. Gretchen Whitmer said schools wouldn’t reopen and K-12 students would learn remotely for the rest of the academic year. The virus has upended the 2020 presidential election, prompting governors to push back state primaries and halting candidates’ cross-country campaigning. On Thursday, Democrats postponed their national convention in Milwaukee, delaying the pivotal event for the primary season until mid-August. Meanwhile, hospitals nationwide prepared for an influx of patients, as shortages of critical supplies including beds, ventilators and masks loom. Hospitalizations in the U.S. could peak as soon as mid-April, and hospitals are projected to need 88,000 more beds than are currently available, according to new estimates from the University of Washington. The federal-government-run national stockpile has sent out nearly half of its ventilators and has fewer than 10,000 still in hand, according to a Wall Street Journal analysis. And American manufacturers say it will be months before they meet demand for protective masks, part of a broader breakdown in the effort to supply enough protective gear and lifesaving equipment to fight the pandemic. States scrambling to acquire medical equipment have had to get creative to fill the gaps, assembling makeshift hospitals in convention centers and sports arenas. New York, the center of the U.S. crisis with more than 92,300 cases, will finance companies to make more ventilators, Gov. Andrew Cuomo said. Massachusetts Gov. Charlie Baker launched a resupply mission for N95 masks using the New England Patriots’s team plane. Louisiana reported a 42% one-day jump in the number of Covid-19 cases, bringing the state’s total to 9,150 cases as officials rushed to combat the virus’s spread in the emerging hot spot. The number of deaths rose to 310 from 273 a day earlier, according to the state health department. Gov. John Bel Edwards called the sharp increase in Covid-19 cases “extremely upsetting.” But he said on Twitter it appeared to be more a sign of a logjam from commercial testing labs, rather than evidence of new exponential growth in the number of residents infected with the virus. Health experts have also voiced concerns about the accuracy of coronavirus testing, believing nearly one in three infected with the illness are testing negative and thus leaving these patients with a false confidence that they can return to business as usual. U.S. stocks were higher despite the bleak labor report, after on Wednesday notching their worst start to a new quarter on record. Boeing is expected to offer early retirements and buyouts, West Virginia postpones its primary, and sailors disembark a U.S. aircraft carrier after nearly 100 crew members test positive for coronavirus. The world-wide count of deaths from the Covid-19 respiratory disease caused by the virus exceeded 50,200, according to Johns Hopkins. Spain on Wednesday reported 950 deaths, the country’s biggest one-day toll, pushing its total past 10,000, most in the world after Italy. Japan, one of the dwindling number of major economies that still allows travelers from most parts of the world besides Europe to enter, will from Friday ban foreigners who have recently been in the U.S., Canada and much of Asia and Latin America. Japan logged 206 new cases on April 1, one of its highest daily tallies, with policy makers saying the recent quick rise could be due to travelers returning from abroad. A security guard checked the temperature of customers as they waited to buy groceries. China, the initial center of the pandemic, has been loosening domestic constraints on travel and business as the prevalence of infection there continues to dwindle. The National Health Commission said the country recorded 90 new cases Wednesday, 52 of which were people who had caught the virus abroad. Out of the daily total, 55 people had no symptoms. Much of the rest of the world remains on lockdown, with factories closed, streets and shops emptied, and health-care systems under strain. France, with more than 24,000 coronavirus patients in hospitals, is transporting many of those on life support from the eastern edge of the country, the region hardest hit by the epidemic, to other regions. Israel’s 71-year-old health minister, Yaakov Litzman, tested positive for the coronavirus and was working from home, his office said Thursday. Israel has registered more than 6,200 cases of the virus and 29 deaths. Prime Minister Benjamin Netanyahu went into isolation last week after an aide tested positive for the virus. He received a negative test on Monday and left quarantine on Wednesday evening, but isolated himself again on Thursday after Mr. Litzman’s positive test. In North Africa, Tunisia extended a nationwide lockdown to April 19. Algeria expanded its limited lockdown, which now covers 14 of its 48 provinces, and prolonged it to April 19. In sub-Saharan Africa, more than a dozen governments have deployed their militaries in recent days to enforce some of the world’s toughest restrictions—leading to some violent confrontations.",
            "time_length": "0",
            "num_words": "0",
            "source_link": "https://www.wsj.com/articles/coronavirus-closes-dwindling-open-borders-as-cases-approach-one-million-11585820944?mod=hp_lead_pos1",
            "title": "Global Coronavirus Cases Top One Million, as Economic Toll Mounts"
        }
    ]
}